_files/Ship/ship-request.xml

<?xml version="1.0" encoding="utf-8"?>

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <ProcessShipmentRequest xmlns="http://fedex.com/ws/ship/v25">
            <WebAuthenticationDetail>
                <UserCredential>
                    <Key>********</Key>
                    <Password>********</Password>
                </UserCredential>
            </WebAuthenticationDetail>
            <ClientDetail>
                <AccountNumber>********</AccountNumber>
                <MeterNumber>********</MeterNumber>
            </ClientDetail>
            <Version>
                <ServiceId>ship</ServiceId>
                <Major>25</Major>
                <Intermediate>0</Intermediate>
                <Minor>0</Minor>
            </Version>
            <RequestedShipment>
                <ShipTimestamp>2020-11-18T14:26:11.204185+08:00</ShipTimestamp>
                <DropoffType>REGULAR_PICKUP</DropoffType>
                <ServiceType>FEDEX_GROUND</ServiceType>
                <PackagingType>YOUR_PACKAGING</PackagingType>
                <PreferredCurrency>USD</PreferredCurrency>
                <Shipper>
                    <AccountNumber>510087160</AccountNumber>
                    <Contact>
                        <PersonName>Donovan</PersonName>
                        <CompanyName>ANL</CompanyName>
                        <PhoneNumber>6262258083</PhoneNumber>
                        <EMailAddress>donovan.xu@longyuan-sh.com</EMailAddress>
                    </Contact>
                    <Address>
                        <StreetLines>16018 Adelante st Suite D</StreetLines>
                        <City>Irwindale</City>
                        <StateOrProvinceCode>CA</StateOrProvinceCode>
                        <PostalCode>91702</PostalCode>
                        <CountryCode>US</CountryCode>
                    </Address>
                </Shipper>
                <Recipient>
                    <Contact>
                        <PersonName>Alex</PersonName>
                        <CompanyName>ANL</CompanyName>
                        <PhoneNumber>8000000000</PhoneNumber>
                        <EMailAddress>alex.cao@longyuan-sh.com</EMailAddress>
                    </Contact>
                    <Address>
                        <StreetLines>401 Independence Rd</StreetLines>
                        <City>FLORENCE</City>
                        <StateOrProvinceCode>NJ</StateOrProvinceCode>
                        <PostalCode>08518</PostalCode>
                        <CountryCode>US</CountryCode>
                    </Address>
                </Recipient>
                <ShippingChargesPayment>
                    <PaymentType>SENDER</PaymentType>
                    <Payor>
                        <ResponsibleParty>
                            <AccountNumber>510087160</AccountNumber>
                            <Contact>
                                <PersonName>Donovan</PersonName>
                                <CompanyName>ANL</CompanyName>
                                <PhoneNumber>6262258083</PhoneNumber>
                                <EMailAddress>donovan.xu@longyuan-sh.com</EMailAddress>
                            </Contact>
                            <Address>
                                <StreetLines>16018 Adelante st Suite D</StreetLines>
                                <City>Irwindale</City>
                                <StateOrProvinceCode>CA</StateOrProvinceCode>
                                <PostalCode>91702</PostalCode>
                                <CountryCode>US</CountryCode>
                            </Address>
                        </ResponsibleParty>
                    </Payor>
                </ShippingChargesPayment>
                <LabelSpecification>
                    <LabelFormatType>COMMON2D</LabelFormatType>
                    <ImageType>PDF</ImageType>
                    <LabelStockType>STOCK_4X6</LabelStockType>
                </LabelSpecification>
                <RateRequestTypes>LIST</RateRequestTypes>
                <RateRequestTypes>PREFERRED</RateRequestTypes>
                <PackageCount>1</PackageCount>
                <RequestedPackageLineItems>
                    <SequenceNumber>1</SequenceNumber>
                    <GroupPackageCount>1</GroupPackageCount>
                    <Weight>
                        <Units>LB</Units>
                        <Value>20</Value>
                    </Weight>
                    <Dimensions>
                        <Length>40</Length>
                        <Width>30</Width>
                        <Height>20</Height>
                        <Units>IN</Units>
                    </Dimensions>
                    <CustomerReferences>
                        <CustomerReferenceType>CUSTOMER_REFERENCE</CustomerReferenceType>
                        <Value>xxxx</Value>
                    </CustomerReferences>
                    <SpecialServicesRequested>
                        <SpecialServiceTypes>SIGNATURE_OPTION</SpecialServiceTypes>
                        <SignatureOptionDetail>
                            <OptionType>DIRECT</OptionType>
                        </SignatureOptionDetail>
                    </SpecialServicesRequested>
                </RequestedPackageLineItems>
            </RequestedShipment>
        </ProcessShipmentRequest>
    </Body>
</Envelope>
